project/atropos-c/cases/mysql-cases/concurrency-case/front_1/parties-3.log
sysbench 1.1.0-f698960 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1.000000 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1.0s ] thds: 4 tps: 40.71 qps: 877.66 (r/w/o: 625.48/166.79/85.38) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 2.0s ] thds: 4 tps: 35.10 qps: 705.93 (r/w/o: 491.35/144.40/70.19) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 3.0s ] thds: 4 tps: 50.89 qps: 1009.80 (r/w/o: 712.45/195.57/101.78) lat (ms,95%): 69.29 err/s: 0.00 reconn/s: 0.00
[ 4.0s ] thds: 4 tps: 56.13 qps: 1123.52 (r/w/o: 782.76/228.51/112.25) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 5.0s ] thds: 4 tps: 64.10 qps: 1281.08 (r/w/o: 900.46/252.41/128.21) lat (ms,95%): 104.84 err/s: 0.00 reconn/s: 0.00
[ 6.0s ] thds: 4 tps: 48.93 qps: 976.70 (r/w/o: 674.10/204.73/97.87) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 7.0s ] thds: 4 tps: 51.05 qps: 1013.00 (r/w/o: 711.70/199.20/102.10) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 8.0s ] thds: 4 tps: 60.91 qps: 1233.24 (r/w/o: 866.76/244.65/121.83) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 9.0s ] thds: 4 tps: 43.08 qps: 862.51 (r/w/o: 603.06/173.30/86.15) lat (ms,95%): 253.35 err/s: 0.00 reconn/s: 0.00
[ 10.0s ] thds: 4 tps: 52.00 qps: 1038.04 (r/w/o: 728.03/206.01/104.00) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 11.0s ] thds: 4 tps: 59.94 qps: 1179.74 (r/w/o: 819.13/240.74/119.87) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 12.0s ] thds: 4 tps: 56.05 qps: 1132.95 (r/w/o: 795.67/225.19/112.09) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 13.0s ] thds: 4 tps: 62.00 qps: 1236.97 (r/w/o: 863.98/248.99/124.00) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 14.0s ] thds: 4 tps: 52.96 qps: 1062.16 (r/w/o: 749.41/206.84/105.92) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 15.0s ] thds: 4 tps: 46.95 qps: 947.06 (r/w/o: 662.34/190.81/93.91) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 16.0s ] thds: 4 tps: 64.88 qps: 1290.66 (r/w/o: 906.36/254.54/129.76) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 17.0s ] thds: 4 tps: 59.10 qps: 1184.05 (r/w/o: 825.43/240.42/118.20) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 18.0s ] thds: 4 tps: 51.91 qps: 1054.11 (r/w/o: 730.69/219.61/103.81) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 19.0s ] thds: 4 tps: 73.28 qps: 1452.61 (r/w/o: 1025.96/280.08/146.57) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
[ 20.0s ] thds: 4 tps: 52.00 qps: 1029.04 (r/w/o: 718.03/207.01/104.00) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 21.0s ] thds: 4 tps: 65.85 qps: 1314.07 (r/w/o: 918.95/263.41/131.71) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 22.0s ] thds: 4 tps: 61.90 qps: 1247.92 (r/w/o: 872.55/251.58/123.79) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 23.0s ] thds: 4 tps: 57.00 qps: 1138.00 (r/w/o: 800.00/224.00/114.00) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 24.0s ] thds: 4 tps: 52.00 qps: 1046.01 (r/w/o: 730.01/212.00/104.00) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 25.0s ] thds: 4 tps: 57.01 qps: 1138.15 (r/w/o: 798.11/226.03/114.02) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 26.0s ] thds: 4 tps: 49.12 qps: 965.27 (r/w/o: 672.59/194.46/98.23) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 27.0s ] thds: 4 tps: 48.07 qps: 946.37 (r/w/o: 657.95/192.28/96.14) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 28.0s ] thds: 4 tps: 41.84 qps: 863.66 (r/w/o: 610.64/169.35/83.68) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 29.0s ] thds: 4 tps: 52.20 qps: 1044.93 (r/w/o: 728.74/211.80/104.39) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 30.0s ] thds: 4 tps: 41.01 qps: 825.10 (r/w/o: 582.07/161.02/82.01) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 31.0s ] thds: 4 tps: 47.00 qps: 936.91 (r/w/o: 656.94/185.98/93.99) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 32.0s ] thds: 4 tps: 46.90 qps: 933.05 (r/w/o: 646.65/192.60/93.80) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 33.0s ] thds: 4 tps: 42.05 qps: 835.99 (r/w/o: 584.69/167.20/84.10) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 34.0s ] thds: 4 tps: 41.88 qps: 840.57 (r/w/o: 592.29/164.52/83.76) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 35.0s ] thds: 4 tps: 47.00 qps: 945.02 (r/w/o: 662.01/189.00/94.00) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 36.0s ] thds: 4 tps: 44.03 qps: 890.70 (r/w/o: 620.49/182.14/88.07) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 37.0s ] thds: 4 tps: 53.16 qps: 1055.18 (r/w/o: 742.24/206.62/106.32) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 38.0s ] thds: 4 tps: 36.91 qps: 711.21 (r/w/o: 493.76/143.64/73.81) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 39.0s ] thds: 4 tps: 33.03 qps: 704.71 (r/w/o: 490.49/148.15/66.07) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 40.0s ] thds: 4 tps: 39.03 qps: 768.66 (r/w/o: 546.47/144.12/78.07) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 41.0s ] thds: 4 tps: 44.85 qps: 898.09 (r/w/o: 627.97/180.42/89.71) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 42.0s ] thds: 4 tps: 42.15 qps: 820.96 (r/w/o: 573.06/163.59/84.30) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 43.0s ] thds: 4 tps: 34.88 qps: 711.52 (r/w/o: 497.27/144.50/69.76) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 44.0s ] thds: 4 tps: 54.15 qps: 1078.03 (r/w/o: 752.11/217.61/108.30) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 45.0s ] thds: 4 tps: 49.05 qps: 978.91 (r/w/o: 690.64/190.18/98.09) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 46.0s ] thds: 4 tps: 49.00 qps: 975.02 (r/w/o: 681.01/196.00/98.00) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 47.0s ] thds: 4 tps: 46.00 qps: 927.94 (r/w/o: 648.96/186.99/91.99) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 48.0s ] thds: 4 tps: 38.93 qps: 776.63 (r/w/o: 540.04/158.72/77.86) lat (ms,95%): 244.38 err/s: 0.00 reconn/s: 0.00
[ 49.0s ] thds: 4 tps: 45.08 qps: 892.60 (r/w/o: 628.12/174.31/90.16) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 50.0s ] thds: 4 tps: 46.91 qps: 950.27 (r/w/o: 666.79/189.65/93.83) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 51.0s ] thds: 4 tps: 52.10 qps: 1027.89 (r/w/o: 715.31/208.38/104.19) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 52.0s ] thds: 4 tps: 26.96 qps: 552.25 (r/w/o: 390.47/107.85/53.93) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 53.0s ] thds: 4 tps: 48.00 qps: 939.01 (r/w/o: 649.01/194.00/96.00) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 54.0s ] thds: 4 tps: 40.05 qps: 826.12 (r/w/o: 579.79/166.23/80.11) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 55.0s ] thds: 4 tps: 45.00 qps: 906.02 (r/w/o: 643.01/173.00/90.00) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 56.0s ] thds: 4 tps: 48.99 qps: 969.84 (r/w/o: 676.89/194.97/97.98) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 57.0s ] thds: 4 tps: 31.95 qps: 625.02 (r/w/o: 433.32/127.80/63.90) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 58.0s ] thds: 4 tps: 47.96 qps: 975.19 (r/w/o: 683.43/195.84/95.92) lat (ms,95%): 262.64 err/s: 0.00 reconn/s: 0.00
[ 59.0s ] thds: 4 tps: 37.98 qps: 765.63 (r/w/o: 540.74/148.93/75.96) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 60.0s ] thds: 4 tps: 40.13 qps: 803.51 (r/w/o: 562.76/160.50/80.25) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 61.0s ] thds: 4 tps: 37.88 qps: 732.62 (r/w/o: 503.36/153.50/75.75) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 62.0s ] thds: 4 tps: 52.11 qps: 1069.21 (r/w/o: 756.56/208.43/104.22) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 63.0s ] thds: 4 tps: 38.98 qps: 746.55 (r/w/o: 517.69/150.91/77.95) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 64.0s ] thds: 4 tps: 45.06 qps: 920.27 (r/w/o: 646.89/183.25/90.12) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 65.0s ] thds: 4 tps: 41.85 qps: 844.04 (r/w/o: 590.93/169.41/83.71) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 66.0s ] thds: 4 tps: 40.00 qps: 792.09 (r/w/o: 557.06/155.02/80.01) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 67.0s ] thds: 4 tps: 49.19 qps: 993.82 (r/w/o: 696.68/198.76/98.38) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 68.0s ] thds: 4 tps: 36.00 qps: 719.92 (r/w/o: 499.94/147.98/71.99) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 69.0s ] thds: 4 tps: 53.00 qps: 1056.06 (r/w/o: 736.04/214.01/106.01) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 70.0s ] thds: 4 tps: 46.00 qps: 936.93 (r/w/o: 656.95/187.99/91.99) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 71.0s ] thds: 4 tps: 43.97 qps: 864.44 (r/w/o: 606.60/169.89/87.94) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 72.0s ] thds: 4 tps: 49.87 qps: 991.34 (r/w/o: 698.13/193.48/99.73) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 73.0s ] thds: 4 tps: 54.18 qps: 1082.63 (r/w/o: 755.53/218.73/108.36) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 74.0s ] thds: 4 tps: 46.00 qps: 924.00 (r/w/o: 650.00/182.00/92.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 75.0s ] thds: 4 tps: 53.00 qps: 1068.96 (r/w/o: 743.97/218.99/106.00) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 76.0s ] thds: 4 tps: 37.00 qps: 743.07 (r/w/o: 521.05/148.01/74.01) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 77.0s ] thds: 4 tps: 28.89 qps: 569.80 (r/w/o: 399.46/112.57/57.78) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 78.0s ] thds: 4 tps: 51.20 qps: 1012.86 (r/w/o: 707.70/202.77/102.39) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 79.0s ] thds: 4 tps: 43.99 qps: 881.90 (r/w/o: 619.93/173.98/87.99) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 80.0s ] thds: 4 tps: 26.00 qps: 526.04 (r/w/o: 361.03/113.01/52.00) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 81.0s ] thds: 4 tps: 32.88 qps: 655.52 (r/w/o: 464.24/125.52/65.75) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 82.0s ] thds: 4 tps: 38.05 qps: 764.06 (r/w/o: 535.74/152.21/76.11) lat (ms,95%): 287.38 err/s: 0.00 reconn/s: 0.00
[ 83.0s ] thds: 4 tps: 48.95 qps: 985.99 (r/w/o: 686.30/201.79/97.90) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 84.0s ] thds: 4 tps: 52.98 qps: 1054.54 (r/w/o: 743.68/204.91/105.95) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 85.0s ] thds: 4 tps: 45.18 qps: 907.55 (r/w/o: 631.47/185.73/90.35) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 86.0s ] thds: 4 tps: 43.90 qps: 866.97 (r/w/o: 609.58/169.60/87.79) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 87.0s ] thds: 4 tps: 44.02 qps: 889.47 (r/w/o: 618.33/183.10/88.05) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 88.0s ] thds: 4 tps: 47.90 qps: 958.02 (r/w/o: 673.61/188.61/95.80) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 89.0s ] thds: 4 tps: 49.18 qps: 972.52 (r/w/o: 678.46/195.71/98.36) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 90.0s ] thds: 4 tps: 43.94 qps: 860.85 (r/w/o: 601.20/171.77/87.88) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            59276
        write:                           16936
        other:                           8468
        total:                           84680
    transactions:                        4234   (47.00 per sec.)
    queries:                             84680  (939.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      46.9951
    time elapsed:                        90.0944s
    total number of events:              4234

Latency (ms):
         min:                                   21.81
         avg:                                   85.09
         max:                                 1889.16
         95th percentile:                      186.54
         sum:                               360280.96

Threads fairness:
    events (avg/stddev):           1058.5000/8.87
    execution time (avg/stddev):   90.0702/0.01